{
  "about": {
    "title": "About me",
    "p1": "👋 <strong>Hey, dev! I'm Guilherme</strong>, a systems developer driven by curiosity, innovation, and the desire to build meaningful solutions.",
    "p2": "With over 2 years of experience in the field, I combine hands-on skills with the best technologies available to <span>turn ideas into modern, efficient, and user-centered products</span>.",
    "p3": "I'm an open source enthusiast and firmly believe that sharing knowledge is one of the most powerful ways to grow — both individually and as a society.",
    "p4": "I'm always evolving, keeping up with trends, exploring new tools, and aiming to deliver not just code, but thoughtful and intelligent solutions.",
    "p5": "This portfolio showcases some of my projects, ideas, and experiences. If you'd like to chat about technology, share ideas, or need help with a project, <strong>I'm here for it!</strong>",
    "p6": "👉 <strong>Take a look at the projects below and feel free to get in touch.</strong>"
  },
  "header": {
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "idioma": "Languages",
    "rede": "Socials"
  },
  "card": {
    "carrerInfo": "Full-stack | Mid-level",
    "info1": "2024 - Present (Front-end developer at 2Clix)",
    "info2": "IT Management",
    "info3": "guilhermepappi@gmail.com",
    "info4": "São Paulo"
  },
  "carro": {
    "toast": "Project still in development!",
    "code": "Check out the code on GitHub.",
    "p1": "This project integrates the OpenWeather API to provide real-time weather forecasts for any location!",
    "p2": "A simple yet highly useful to-do list to help you stay organized and not forget anything important!",
    "pName": "Still developing...",
    "p3": "Not done yet!"
  },
  "main": {
    "info1": "Hey,",
    "info2": "I'm <span>Guilherme</span>,",
    "info3": "Full-stack Developer",
    "info4": "I enjoy programming, solving problems, and turning ideas into code. With a good cup of coffee and solid documentation, I turn your problem into a solution.",
    "info5": "If you liked my work, need something, or are interested in what I do, feel free to reach out —",
    "talk": "Let's talk"
  },
  "projects": {
    "title": "Projects",
    "taskoomDescription": "Taskoom is a modern task management system that provides secure authentication via JWT, efficient organization through lists and tasks, and integration with Hugging Face AI to suggest and optimize list creation.",
    "weatherDescription": "A weather app that shows forecasts based on your location and weather API, featuring smooth animations and up-to-date data.",
    "todolistDescription": "A lightweight and intuitive to-do list for quick task management with local persistence.",
    "taskoomRole": "Productivity system",
    "weatherRole": "Weather forecast app",
    "todolistRole": "Simple task manager",
    "verProjeto": "Open project",
    "verDescricao": "Description",
    "verCodigo": "Source code"
  },
  "footer": {
    "aboutTitle": "About",
    "aboutText": "I develop modern, high-performance, and tailor-made web solutions to transform ideas into amazing digital experiences.",
    "connectTitle": "Contact",
    "copyright": "© 2025 Guilherme Pappi. All rights reserved. Brazilian company registered under CNPJ No. 60.538.470/0001-35",
    "toTop": "Back to top"
  },
  "works": {
    "title": "Projetos"
  }
}