{
  "about": {
    "title": "Sobre mim",
    "p1": "<strong>Me chamo Guilherme</strong>, sou desenvolvedor de sistemas movido por curiosidade, inovação e a vontade de criar soluções que realmente fazem a diferença.",
    "p2":"Gosto de programar, resolver problemas e transformar ideias em código. Com uma boa xícara de café e a documentação certa, pego seu desafio e entrego soluções práticas, modernas e eficientes. Uso as melhores tecnologias do mercado para <span>transformar ideias em produtos reais, funcionais e centrados na experiência do usuário</span>.",
    "p3": "Sou entusiasta do open source e acredito que compartilhar conhecimento é uma das formas mais poderosas de evoluir — pessoalmente e como sociedade.",
    "p4": "Estou sempre em movimento, estudando tendências, explorando novas ferramentas e buscando entregar não só código, mas soluções inteligentes e bem pensadas.",
    "p5": "Este portfólio reúne alguns dos meus projetos, conceitos e experiências. Se quiser trocar ideias, falar sobre tecnologia ou precisar de ajuda em algum projeto, <strong>estou à disposição!</strong>",
    "p6": "<strong>Explore os projetos abaixo e fique à vontade para entrar em contato.</strong>"
  },
  "header": {
    "home": "Home",
    "about": "Sobre",
    "projects": "Projetos",
    "idioma": "Idiomas",
    "rede": "Redes"
  },
  "card": {
    "carrerInfo": "Full-stack | Pleno",
    "info1": "2024 - Atual (Dev. Front-end na 2Clix)",
    "info2": "Gestão da Tecnologia da Informação",
    "info3": "guilhermepappi@gmail.com",
    "info4": "São Paulo"
  },
  "carro": {
    "toast": "Projeto ainda em desenvolvimento!",
    "code": "Código no GitHub",
    "p1": "Esse projeto integra a API da OpenWeather para fornecer previsões do tempo em tempo real para qualquer localidade!",
    "p2": "Uma lista de tarefas simples, mas altamente útil, para ajudar você a se organizar e não esquecer de nada importante!",
    "pName": "Projeto futro",
    "p3": "Uma aplicação full stack desenvolvida para ajudar usuários a organizarem suas tarefas de forma intuitiva, eficiente e moderna. O sistema conta com autenticação segura, gerenciamento completo de tarefas e uma interface fluida com suporte a drag and drop."
  },
  "main": {
    "info1": "Hey,",
    "info2": "Sou <span>Guilherme</span>,",
    "info3": "Desenvolvedor Full-stack",
    "info4": "Desenvolvo soluções web modernas, performáticas e sob medida para transformar ideias em experiências digitais incríveis.",
    "info5": "Se gostou do meu trabalho, precisar de algo ou se interessou pelo que faço, me chama —",
    "talk": "Vamos conversar"
  },
  "projects": {
    "title": "Projetos",
    "taskoomDescription": "Plataforma para gerenciamento de tarefas com autenticação JWT/OAuth, organização por listas e tarefas, além de integração com IA da Hugging Face para sugerir e otimizar a criação de listas.",
    "weatherDescription": "App que exibe a previsão do tempo com base em localização e API de clima, com animações e dados atualizados.",
    "todolistDescription": "Uma to-do list leve e intuitiva para gerenciamento rápido de tarefas com persistência local.",
    "pokedexDescription": "Pokédex interativa com busca por Pokémon, exibição de habilidades, tipos, evolução e opção de favoritos. Inspirada no estilo dos jogos de Game Boy, com interface responsiva. Desenvolvida com Ionic e Angular para um desafio técnico.",
    "taskoomRole": "Sistema de produtividade",
    "weatherRole": "App de previsão do tempo",
    "todolistRole": "Gerenciador de tarefas simples",
    "pokedexRole": "Catálogo interativo de Pokémon",
    "verProjeto": "Abrir projeto",
    "verDescricao": "Descrição",
    "verCodigo": "Código"
  },
  "footer": {
    "aboutTitle": "Sobre",
    "aboutText": "Desenvolvo soluções web modernas, performáticas e sob medida para transformar ideias em experiências digitais incríveis.",
    "connectTitle": "Conecte-se",
    "copyright": "© 2025 Guilherme Pappi. Todos os direitos reservados. CNPJ sob n° 60.538.470/0001-35",
    "toTop": "Voltar ao topo"
  },
  "works": {
    "title": "Projetos"
  }
}