{
  "about": {
    "title": "Sobre mim",
    "p1": "👋 <strong>Me chamo Guilherme Pappi</strong>, sou desenvolvedor de sistemas, amante de tecnologia, inovação e criação de aplicações.",
    "p2": "Sou um grande apoiador da cultura do open source e estou sempre aprendendo e evoluindo, de olho nas novas tendências para entregar resultados cada vez melhores. Acredito no potencial do conhecimento como agente de mudança social e pessoal.",
    "p3": "Sou desenvolvedor há 2 anos e trago experiência prática com as melhores tecnologias do mercado, sempre focado em <span>transformar ideias e problemas em ótimas e modernas soluções</span>.",
    "p4": "Neste portfólio mostro um pouco dos meus projetos, minhas ideias e do que desenvolvo. Se quiser conversar sobre projetos, ideias ou precisar de alguma ajuda, pode contar comigo!",
    "p5": "<strong>Aproveite e dê uma olhada nos meus projetos logo abaixo!</strong>"
  },
  "header": {
    "home": "Home",
    "about": "Sobre",
    "projects": "Projetos",
    "idioma": "Idiomas",
    "rede": "Redes"
  },
  "card": {
    "carrerInfo": "Full-stack | Pleno",
    "info1": "2024 - Atual (Dev. Front-end na 2Clix)",
    "info2": "Gestão da Tecnologia da Informação",
    "info3": "guilhermepappi@gmail.com",
    "info4": "São Paulo"
  },
  "carro": {
    "toast": "Projeto ainda em desenvolvimento!",
    "code": "Código no GitHub",
    "p1": "Esse projeto integra a API da OpenWeather para fornecer previsões do tempo em tempo real para qualquer localidade!",
    "p2": "Uma lista de tarefas simples, mas altamente útil, para ajudar você a se organizar e não esquecer de nada importante!",
    "pName": "Projeto futro",
    "p3": "Uma aplicação full stack desenvolvida para ajudar usuários a organizarem suas tarefas de forma intuitiva, eficiente e moderna. O sistema conta com autenticação segura, gerenciamento completo de tarefas e uma interface fluida com suporte a drag and drop."
  },
  "main": {
    "info1": "Hey,",
    "info2": "Sou <span>Guilherme</span>,",
    "info3": "Desenvolvedor Full-stack",
    "info4": "Gosto de programar, resolver problemas e transformar ideias em código. Com uma boa xícara de café e uma boa documentação, transformo seu problema em solução.",
    "info5": "Se gostou do meu trabalho, precisar de algo ou se interessou pelo que faço, me chama —",
    "talk": "Vamos conversar"
  },
  "projects": {
    "title": "Projetos",
    "taskoomDescription": "Taskoom é um sistema moderno de gerenciamento de tarefas que oferece autenticação segura via JWT, organização eficiente por listas e tarefas, além de integração com IA da Hugging Face para sugerir e otimizar a criação de listas.",
    "weatherDescription": "App que exibe a previsão do tempo com base em localização e API de clima, com animações e dados atualizados.",
    "todolistDescription": "Uma to-do list leve e intuitiva para gerenciamento rápido de tarefas com persistência local.",
    "taskoomRole": "Sistema de produtividade",
    "weatherRole": "App de previsão do tempo",
    "todolistRole": "Gerenciador de tarefas simples",
    "verProjeto": "Abrir projeto",
    "verDescricao": "Descrição",
    "verCodigo": "Código"

  },
  "footer": {
    "aboutTitle": "Sobre",
    "aboutText": "Desenvolvo soluções web modernas, performáticas e sob medida para transformar ideias em experiências digitais incríveis.",
    "connectTitle": "Conecte-se",
    "copyright": "© 2025 Guilherme Pappi. Todos os direitos reservados.",
    "toTop": "Voltar ao topo"
  },
  "works": {
    "title": "Projetos"
  }
}